[
    {
        "activity_name": "Question-1",
        "activity_json": [
            {
                "activityType": "assignment",
                "questions": [
                    {
                        "questionType": "filesubmission",
                        "max_marks": 20,
                        "evaluate": true,
                        "questionText": [
                            {
                                "text": "Please read the Hangman Introduction before starting this problem. We'll start by writing 3 simple functions that will help us easily code the Hangman problem. First, implement the function isWordGuessed that takes in two parameters - a string, secretWord, and a list of letters, lettersGuessed. This function returns a boolean - True if secretWord has been guessed (ie, all the letters of secretWord are in lettersGuessed) and False otherwise.<br><br>Next, implement the function getGuessedWord that takes in two parameters - a string, secretWord, and a list of letters, lettersGuessed. This function returns a string that is comprised of letters and underscores, based on what letters in lettersGuessed are in secretWord. This shouldn't be too different from isWordGuessed!<br><br>When inserting underscores into your string, it's a good idea to add at least a space after each one, so it's clear to the user how many unguessed letters are left in the string (compare the readability of ____ with _ _ _ _ ). This is called usability - it's very important, when programming, to consider the usability of your program. If users find your program difficult to understand or operate, they won't use it!<br><br>For this problem, you are free to use spacing in any way you wish - our grader will only check that the letters and underscores are in the proper order; it will not look at spacing. We do encourage you to think about usability when designing.<br><br>Next, implement the function getAvailableLetters that takes in one parameter - a list of letters, lettersGuessed. This function returns a string that is comprised of lowercase English letters - all lowercase English letters that are not in lettersGuessed.<br>br>Note that this function should return the letters in alphabetical order, as in the example above.<br><br>Hints:You might consider using string.ascii_lowercase, which is a string comprised of all lowercase letters:<br><br>Now you will implement the function hangman, which takes one parameter - the secretWord the user is to guess. This starts up an interactive game of Hangman between the user and the computer. Be sure you take advantage of the three helper functions, isWordGuessed, getGuessedWord, and getAvailableLetters, that you've defined in the previous part.<br><br>Hints<br>You should start by noticing where we're using the provided functions (at the top of ps3_hangman.py) to load the words and pick a random one. Note that the functions loadWords and chooseWord should only be used on your local machine, not in the tutor. When you enter in your solution in the tutor, you only need to give your hangman function.<br>Consider using lower() to convert user input to lower case. For example:<br>guess = 'A'<br>guessInLowerCase = guess.lower()<br>Consider writing additional helper functions if you need them!<br>There are four important pieces of information you may wish to store:<br>secretWord: The word to guess.<br>lettersGuessed: The letters that have been guessed so far.<br>mistakesMade: The number of incorrect guesses made so far.<br>availableLetters: The letters that may still be guessed. Every time a player guesses a letter, the guessed letter must be removed from availableLetters (and if they guess a letter that is not in availableLetters, you should print a message telling them they've already guessed that - so try again!)"
                            }
                        ],
                        "question_id": "Q1"
                    }
                ],
                "title": "We designed some Assignments for you to practice Please solve the Assignments and submit them"
            }
        ],
        "activity_id": "A1"
    }
]